loadtesting/loadtest.yml
config:
  target: 'http://localhost:3004'
  processor: "./my-functions.js"
  phases:
    - duration: 10
      arrivalRate: 50
scenarios:
  - name: "load restaurant page"
    flow:
      - function: "generateRandomData"
      - loop:
        - get:
            url: "/api/restaurants/{{randomId}}/recommendations"
        count: 100