loadtesting/loadtest.yml
config:
  target: 'http://54.215.119.119:3004'
  # target: 'http://localhost:3004'
  processor: "./my-functions.js"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - name: "load restaurant page"
    flow:
      - function: "generateRandomData"
      - loop:
        - get:
            url: "/api/restaurants/{{randomId}}/recommendations"
        count: 80
      - function: "generateLessRandomId"
      - loop:
        - get:
            url: "/api/restaurants/{{lessRandomId}}/recommendations"
        count: 20